{
    "role_1": "Physicist_RoleType.ASSISTANT",
    "topic;": "Quantum field theory",
    "sub_topic": "Calculation of effective field theories in quantum field theory.",
    "message_1": "What is the effective field theory of a quantum system when the energy scale is lower than the scale of its mass? Solve this problem by calculating the dominant term in the Taylor expansion of the action of the quantum system, and determine the effective mass and coupling constant of the theory.",
    "message_2": "To find the effective field theory of a quantum system when the energy scale is lower than the scale of its mass, we need to integrate out the heavy degrees of freedom and obtain an effective action that describes the low-energy physics of the system. \n\nLet's consider a scalar field theory with a Lagrangian density given by:\n\nL = 1/2 (∂_μφ)(∂^μφ) - 1/2 m^2 φ^2 - λ φ^4\n\nwhere φ is the scalar field, m is the mass of the field, and λ is the coupling constant. We are interested in the low-energy regime, so we can expand the action in powers of the energy scale E, which is much smaller than the mass scale m.\n\nTo do this, we can perform a Taylor expansion of the action S = ∫d^4x L around the classical field configuration φ_0:\n\nS[φ] = S[φ_0] + ∫d^4x (δS/δφ)|_φ0 (φ - φ_0) + 1/2 ∫d^4x d^4y (δ^2S/δφ(x)δφ(y))|_φ0 (φ(x) - φ_0(x))(φ(y) - φ_0(y)) + ...\n\nSince we are interested in the dominant term in the expansion, we can focus on the quadratic term in the action:\n\nS_quad = 1/2 ∫d^4x d^4y (δ^2S/δφ(x)δφ(y))|_φ0 (φ(x) - φ_0(x))(φ(y) - φ_0(y))\n\nThe effective action is obtained by integrating out the heavy degrees of freedom, which can be done by solving the equation of motion for the field φ in the low-energy regime:\n\n(∂^2 + m^2) φ = 0\n\nThe solution to this equation can be written in terms of the Green's function G(x-y):\n\nφ(x) = ∫d^4y G(x-y) J(y)\n\nwhere J(y) is an external source term. Plugging this solution back into the quadratic action, we obtain the effective action:\n\nS_eff = 1/2 ∫d^4x d^4y J(x) G(x-y) J(y)\n\nNow, we can read off the effective mass and coupling constant of the theory from the effective action. The effective mass is given by the inverse of the Green's function:\n\nm_eff^2 = 1/G(0)\n\nThe effective coupling constant can be determined from the interaction term in the effective action, which is proportional to J^2:\n\nλ_eff = (1/2) G(0)^2\n\nIn summary, to find the effective field theory of a quantum system when the energy scale is lower than the scale of its mass, we need to integrate out the heavy degrees of freedom and obtain an effective action that describes the low-energy physics of the system. The dominant term in the Taylor expansion of the action gives us the effective mass and coupling constant of the theory."
}