{
    "role_1": "Physicist_RoleType.ASSISTANT",
    "topic;": "Quantum field theory",
    "sub_topic": "Calculation of string theory in quantum field theory.",
    "message_1": "What is the calculation of the string spectrum in bosonic string theory using the Polyakov path integral formulation in quantum field theory?",
    "message_2": "In the Polyakov path integral formulation of bosonic string theory, the string spectrum is calculated by quantizing the string's worldsheet action. The worldsheet action is given by the Polyakov action:\n\nS = - (1/4πα') ∫ d²σ √(-h) h^αβ ∂_α X^μ ∂_β X_μ\n\nHere, α' is the Regge slope parameter (related to the string tension), h is the determinant of the worldsheet metric h^αβ, and X^μ are the spacetime coordinates of the string. The integral is over the worldsheet coordinates σ^α (α = 0, 1).\n\nTo quantize the theory, we first fix the worldsheet metric to the conformal gauge, which simplifies the action:\n\nS = - (1/2πα') ∫ d²σ (∂_α X^μ ∂^α X_μ)\n\nNext, we expand the spacetime coordinates X^μ in terms of their Fourier modes:\n\nX^μ(σ, τ) = x^μ + 2α'p^μτ + i√(2α') ∑_n ≠ 0 (1/n) α^μ_n e^(-in(τ+σ)) + ā^μ_n e^(-in(τ-σ))\n\nHere, x^μ and p^μ are the center of mass position and momentum of the string, and α^μ_n and ā^μ_n are the creation and annihilation operators.\n\nNow, we impose the Virasoro constraints, which are the quantum version of the classical equations of motion for the worldsheet metric:\n\nL_n = (1/2) ∑_m α^μ_(n-m) α^ν_m η_μν = 0\nL̄_n = (1/2) ∑_m ā^μ_(n-m) ā^ν_m η_μν = 0\n\nHere, η_μν is the Minkowski metric, and n, m are integers.\n\nThe string spectrum is determined by the physical states, which are annihilated by the positive Virasoro modes:\n\nL_n |phys⟩ = 0 for n > 0\nL̄_n |phys⟩ = 0 for n > 0\n\nThe mass spectrum of the physical states is given by the mass-shell condition:\n\nM^2 = (4α')^(-1) (N + N̄ - 2)\n\nHere, M is the mass of the string state, and N and N̄ are the level-matching conditions:\n\nN = ∑_n > 0 α^μ_-n α^ν_n η_μν\nN̄ = ∑_n > 0 ā^μ_-n ā^ν_n η_μν\n\nThe string spectrum is then obtained by solving these conditions and identifying the physical states. The bosonic string spectrum contains a tachyon (a state with negative mass squared) at the lowest level, massless states (including the graviton), and an infinite tower of massive states."
}