{
    "role_1": "Physicist_RoleType.ASSISTANT",
    "topic;": "Quantum field theory",
    "sub_topic": "Calculation of conformal field theories in quantum field theory.",
    "message_1": "How to calculate correlation functions of primary fields in conformal field theories?",
    "message_2": "In conformal field theories (CFTs), correlation functions of primary fields play a crucial role in understanding the underlying structure and symmetries of the theory. To calculate the correlation functions of primary fields, we need to consider the conformal symmetry and the properties of the primary fields.\n\nLet's consider a 2D CFT with primary fields φ_i, where i = 1, 2, ..., N. The two-point and three-point correlation functions are the most fundamental ones, and higher-point correlation functions can be constructed from them.\n\n1. Two-point correlation function:\n\nThe two-point correlation function of primary fields φ_i and φ_j is given by:\n\n<φ_i(x) φ_j(y)> = C_ij / |x - y|^(2Δ_i)\n\nHere, x and y are the positions of the fields, Δ_i is the scaling dimension of the primary field φ_i, and C_ij is a constant that depends on the fields. The two-point function vanishes if the scaling dimensions of the fields are different, i.e., Δ_i ≠ Δ_j.\n\n2. Three-point correlation function:\n\nThe three-point correlation function of primary fields φ_i, φ_j, and φ_k is given by:\n\n<φ_i(x_1) φ_j(x_2) φ_k(x_3)> = C_ijk / (|x_1 - x_2|^(Δ_i + Δ_j - Δ_k) |x_2 - x_3|^(Δ_j + Δ_k - Δ_i) |x_3 - x_1|^(Δ_k + Δ_i - Δ_j))\n\nHere, x_1, x_2, and x_3 are the positions of the fields, and C_ijk is a constant that depends on the fields. The three-point function is completely determined by conformal symmetry, up to the constant C_ijk.\n\nFor higher-point correlation functions, we need to use the operator product expansion (OPE) and conformal blocks. The OPE expresses the product of two primary fields as a sum over other primary fields and their descendants:\n\nφ_i(x) φ_j(y) = ∑_k C_ijk (x - y)^(-Δ_i - Δ_j + Δ_k) φ_k(y) + ...\n\nHere, the sum runs over all primary fields φ_k, and the dots represent the descendant fields. By using the OPE, we can reduce higher-point correlation functions to a sum of products of lower-point correlation functions, which can then be calculated using the two-point and three-point functions.\n\nIn summary, to calculate correlation functions of primary fields in conformal field theories, we need to consider the conformal symmetry, scaling dimensions, and the operator product expansion. The two-point and three-point correlation functions are the most fundamental ones, and higher-point correlation functions can be constructed from them using the OPE and conformal blocks."
}