{
    "role_1": "Physicist_RoleType.ASSISTANT",
    "topic;": "Quantum field theory",
    "sub_topic": "Calculation of effective field theories in quantum field theory.",
    "message_1": "How can we calculate the effective field theory of a quantum field theory model, specifically in the context of studying the behavior of particles at low energies? Illustrate your answer with appropriate calculations and examples.",
    "message_2": "Effective Field Theory (EFT) is a powerful tool in quantum field theory (QFT) that allows us to study the behavior of particles at low energies by integrating out high-energy degrees of freedom. This simplifies the calculations and makes it possible to focus on the relevant low-energy physics. Here's a step-by-step guide on how to calculate the EFT of a QFT model:\n\n1. Identify the relevant energy scale: Determine the energy scale of interest, typically denoted as Λ. This scale separates the low-energy physics (E << Λ) from the high-energy physics (E >> Λ).\n\n2. Write down the most general Lagrangian: Write down the most general Lagrangian consistent with the symmetries of the underlying QFT. This Lagrangian should include all possible operators, organized by their mass dimension. The coefficients of these operators are determined by the underlying QFT.\n\n3. Integrate out heavy particles: Identify the heavy particles (with masses M >> Λ) and integrate them out using the path integral formalism or by solving their equations of motion. This will generate new effective operators in the Lagrangian, suppressed by powers of Λ/M.\n\n4. Organize the EFT in terms of a power series: Rewrite the effective Lagrangian as a power series in E/Λ, where E is the energy of the external particles. The leading-order term in this series corresponds to the low-energy physics, while higher-order terms represent corrections due to the high-energy physics.\n\n5. Calculate observables: Use the effective Lagrangian to calculate observables of interest, such as scattering amplitudes or decay rates, at low energies. These calculations can be performed using standard techniques in QFT, such as perturbation theory or the Feynman diagram approach.\n\nExample: Fermi Theory of Weak Interactions\n\nConsider the Fermi theory of weak interactions, which describes the beta decay of a neutron into a proton, an electron, and an anti-neutrino. The underlying QFT is the electroweak theory, which includes the W-boson as a heavy particle (M_W >> Λ).\n\n1. Identify the relevant energy scale: In this case, the energy scale of interest is the energy of the emitted electron, which is much smaller than the mass of the W-boson (E << M_W).\n\n2. Write down the most general Lagrangian: The electroweak Lagrangian includes terms involving the W-boson, fermions, and the Higgs field. For simplicity, we focus on the terms relevant to beta decay.\n\n3. Integrate out heavy particles: We integrate out the W-boson by solving its equation of motion or using the path integral formalism. This generates an effective four-fermion interaction, suppressed by the mass of the W-boson (1/M_W^2).\n\n4. Organize the EFT in terms of a power series: The effective Lagrangian for the Fermi theory is given by L_Fermi = G_F/sqrt(2) * (J_μ^+ * J^μ_-), where G_F is the Fermi constant, J_μ^+ is the charged current for the proton and neutrino, and J^μ_- is the charged current for the neutron and electron. This Lagrangian is already organized as a power series in E/M_W, with the leading-order term representing the low-energy physics.\n\n5. Calculate observables: Using the Fermi theory, we can calculate the decay rate of the neutron and the energy spectrum of the emitted electron. These calculations can be performed using standard techniques in QFT, such as perturbation theory or the Feynman diagram approach.\n\nIn conclusion, the EFT approach allows us to study the behavior of particles at low energies by integrating out high-energy degrees of freedom and focusing on the relevant low-energy physics. This simplifies the calculations and makes it possible to obtain accurate predictions for observables of interest."
}